zyf021027/STM32F103ZE/STD_STM32F103ZET6_USART/AUDIO_RECORD/record_board_audio.c
#include "record_board_audio.h"

#include <string.h>

#include "stm32f10x.h"
#include "audio_baremetal_compat.h"

#define AUDIO_I2C_PORT GPIOB
#define AUDIO_I2C_SCL GPIO_Pin_6
#define AUDIO_I2C_SDA GPIO_Pin_7
#define AUDIO_I2S_MCLK_PORT GPIOC
#define AUDIO_I2S_MCLK_PIN GPIO_Pin_7
#define AUDIO_I2S_WS_PORT GPIOA
#define AUDIO_I2S_WS_PIN GPIO_Pin_15
#define AUDIO_I2S_CK_PORT GPIOB
#define AUDIO_I2S_CK_PIN GPIO_Pin_3
#define AUDIO_I2S_SD_PORT GPIOB
#define AUDIO_I2S_SD_PIN GPIO_Pin_5
#define AUDIO_I2S_RX_PORT GPIOB
#define AUDIO_I2S_RX_PIN GPIO_Pin_4
#define AUDIO_AMP_PORT GPIOC
#define AUDIO_AMP_PIN GPIO_Pin_13
#define AUDIO_AMP_ENABLE() GPIO_ResetBits(AUDIO_AMP_PORT, AUDIO_AMP_PIN)
#define AUDIO_AMP_DISABLE() GPIO_SetBits(AUDIO_AMP_PORT, AUDIO_AMP_PIN)
#define ES8311_I2C_ADDR_WRITE_LOW 0x30
#define ES8311_I2C_ADDR_WRITE_HIGH 0x32
#define ES8311_I2C_READ_OFFSET 0x01
#define AUDIO_SAMPLE_RATE 48000U
#define AUDIO_TEST_TABLE_SIZE 48U
#define AUDIO_PLAYBACK_VOLUME_PERCENT 10U
#define AUDIO_MODE_NONE 0
#define AUDIO_MODE_PLAYBACK 1
#define AUDIO_MODE_RECORD 2
#define AUDIO_DMA_BUFFER_HALFWORDS 4096U
#define AUDIO_DMA_PREROLL_HALFWORDS 1024U
#define AUDIO_DMA_GUARD_HALFWORDS 32U
#define AUDIO_DMA_CHANNEL DMA2_Channel2
static int16_t g_audio_dma_buffer[AUDIO_DMA_BUFFER_HALFWORDS];
static uint32_t g_audio_dma_write_index;
static uint32_t g_audio_dma_last_read_index;
static uint32_t g_audio_dma_read_wraps;
static uint32_t g_audio_dma_read_total;
static uint32_t g_audio_dma_write_total;
static int g_audio_dma_started;
static uint32_t g_audio_dma_underruns;

static const int16_t audio_test_wave[AUDIO_TEST_TABLE_SIZE] = {
    0, 1566, 3105, 4592, 6000, 7308, 8485, 9510,
    10392, 11012, 11590, 11876, 12000, 11876, 11590, 11012,
    10392, 9510, 8485, 7308, 6000, 4592, 3105, 1566,
    0, -1566, -3105, -4592, -6000, -7308, -8485, -9510,
    -10392, -11012, -11590, -11876, -12000, -11876, -11590, -11012,
    -10392, -9510, -8485, -7308, -6000, -4592, -3105, -1566};

static int16_t board_audio_apply_volume(int16_t sample)
{
    int32_t value = ((int32_t)sample * (int32_t)AUDIO_PLAYBACK_VOLUME_PERCENT) / 100;

    if (value > 32767)
        return 32767;
    if (value < -32768)
        return -32768;
    return (int16_t)value;
}
static board_audio_debug_info_t g_audio_debug;
static uint32_t board_audio_dma_used_halfwords(void);
static void board_audio_update_dma_debug(void)
{
    g_audio_debug.dma_underruns = g_audio_dma_underruns;
    g_audio_debug.dma_used_halfwords = board_audio_dma_used_halfwords();
    g_audio_debug.dma_write_index = g_audio_dma_write_index;
}
static uint8_t g_es8311_addr_write = ES8311_I2C_ADDR_WRITE_LOW;

static void audio_delay_short(void)
{
    volatile int i;
    for (i = 0; i < 40; ++i)
    {
        __NOP();
    }
}

static void board_audio_set_error(int err)
{
    g_audio_debug.last_error = err;
}

static void board_audio_reset_debug(int mode)
{
    memset(&g_audio_debug, 0, sizeof(g_audio_debug));
    g_audio_debug.last_mode = mode;
    g_audio_debug.last_sample_rate = AUDIO_SAMPLE_RATE;
}

static void i2c_scl_high(void)
{
    GPIO_SetBits(AUDIO_I2C_PORT, AUDIO_I2C_SCL);
    audio_delay_short();
}
static void i2c_scl_low(void)
{
    GPIO_ResetBits(AUDIO_I2C_PORT, AUDIO_I2C_SCL);
    audio_delay_short();
}
static void i2c_sda_high(void)
{
    GPIO_SetBits(AUDIO_I2C_PORT, AUDIO_I2C_SDA);
    audio_delay_short();
}
static void i2c_sda_low(void)
{
    GPIO_ResetBits(AUDIO_I2C_PORT, AUDIO_I2C_SDA);
    audio_delay_short();
}
static int i2c_sda_read(void) { return GPIO_ReadInputDataBit(AUDIO_I2C_PORT, AUDIO_I2C_SDA); }

static void i2c_start(void)
{
    i2c_sda_high();
    i2c_scl_high();
    i2c_sda_low();
    i2c_scl_low();
}

static void i2c_stop(void)
{
    i2c_sda_low();
    i2c_scl_high();
    i2c_sda_high();
}

static int i2c_write_byte(uint8_t value)
{
    int bit;
    int ack;

    for (bit = 0; bit < 8; ++bit)
    {
        if (value & 0x80U)
            i2c_sda_high();
        else
            i2c_sda_low();
        i2c_scl_high();
        i2c_scl_low();
        value <<= 1;
    }

    i2c_sda_high();
    i2c_scl_high();
    ack = i2c_sda_read();
    i2c_scl_low();
    return ack == 0 ? 0 : -1;
}

static uint8_t i2c_read_byte(int ack)
{
    int bit;
    uint8_t value = 0;

    i2c_sda_high();
    for (bit = 0; bit < 8; ++bit)
    {
        value <<= 1;
        i2c_scl_high();
        if (i2c_sda_read())
            value |= 1U;
        i2c_scl_low();
    }

    if (ack)
        i2c_sda_low();
    else
        i2c_sda_high();
    i2c_scl_high();
    i2c_scl_low();
    i2c_sda_high();
    return value;
}

static int es8311_write_reg_to(uint8_t addr, uint8_t reg, uint8_t value)
{
    int result;

    i2c_start();
    result = i2c_write_byte(addr);
    result |= i2c_write_byte(reg);
    result |= i2c_write_byte(value);
    i2c_stop();
    return result;
}

static int es8311_write_reg(uint8_t reg, uint8_t value)
{
    int result = es8311_write_reg_to(g_es8311_addr_write, reg, value);

    if (result != 0)
        g_audio_debug.codec_fail_reg = reg;
    return result;
}

static int es8311_read_reg(uint8_t reg, uint8_t *value)
{
    int result;

    i2c_start();
    result = i2c_write_byte(g_es8311_addr_write);
    result |= i2c_write_byte(reg);
    i2c_start();
    result |= i2c_write_byte((uint8_t)(g_es8311_addr_write | ES8311_I2C_READ_OFFSET));
    if (result == 0)
        *value = i2c_read_byte(0);
    i2c_stop();
    if (result != 0)
        g_audio_debug.codec_fail_reg = reg;
    return result;
}

static void board_audio_capture_debug_regs(void)
{
    uint8_t value;

    if (es8311_read_reg(0x00, &value) == 0)
        g_audio_debug.codec_reg00 = value;
    if (es8311_read_reg(0x01, &value) == 0)
        g_audio_debug.codec_reg01 = value;
    if (es8311_read_reg(0x02, &value) == 0)
        g_audio_debug.codec_reg02 = value;
    if (es8311_read_reg(0x03, &value) == 0)
        g_audio_debug.codec_reg03 = value;
    if (es8311_read_reg(0x04, &value) == 0)
        g_audio_debug.codec_reg04 = value;
    if (es8311_read_reg(0x05, &value) == 0)
        g_audio_debug.codec_reg05 = value;
    if (es8311_read_reg(0x06, &value) == 0)
        g_audio_debug.codec_reg06 = value;
    if (es8311_read_reg(0x07, &value) == 0)
        g_audio_debug.codec_reg07 = value;
    if (es8311_read_reg(0x08, &value) == 0)
        g_audio_debug.codec_reg08 = value;
    if (es8311_read_reg(0x09, &value) == 0)
        g_audio_debug.codec_reg09 = value;
    if (es8311_read_reg(0x0A, &value) == 0)
        g_audio_debug.codec_reg0a = value;
    if (es8311_read_reg(0x0B, &value) == 0)
        g_audio_debug.codec_reg0b = value;
    if (es8311_read_reg(0x0C, &value) == 0)
        g_audio_debug.codec_reg0c = value;
    if (es8311_read_reg(0x0D, &value) == 0)
        g_audio_debug.codec_reg0d = value;
    if (es8311_read_reg(0x0E, &value) == 0)
        g_audio_debug.codec_reg0e = value;
    if (es8311_read_reg(0x0F, &value) == 0)
        g_audio_debug.codec_reg0f = value;
    if (es8311_read_reg(0x10, &value) == 0)
        g_audio_debug.codec_reg10 = value;
    if (es8311_read_reg(0x11, &value) == 0)
        g_audio_debug.codec_reg11 = value;
    if (es8311_read_reg(0x12, &value) == 0)
        g_audio_debug.codec_reg12 = value;
    if (es8311_read_reg(0x13, &value) == 0)
        g_audio_debug.codec_reg13 = value;
    if (es8311_read_reg(0x14, &value) == 0)
        g_audio_debug.codec_reg14 = value;
    if (es8311_read_reg(0x16, &value) == 0)
        g_audio_debug.codec_reg16 = value;
    if (es8311_read_reg(0x25, &value) == 0)
        g_audio_debug.codec_reg25 = value;
    if (es8311_read_reg(0x31, &value) == 0)
        g_audio_debug.codec_reg31 = value;
    if (es8311_read_reg(0x32, &value) == 0)
        g_audio_debug.codec_reg32 = value;
    if (es8311_read_reg(0x33, &value) == 0)
        g_audio_debug.codec_reg33 = value;
    if (es8311_read_reg(0x34, &value) == 0)
        g_audio_debug.codec_reg34 = value;
    if (es8311_read_reg(0x37, &value) == 0)
        g_audio_debug.codec_reg37 = value;
    if (es8311_read_reg(0x44, &value) == 0)
        g_audio_debug.codec_reg44 = value;

