zyf021027/STM32F103ZE/STD_STM32F103ZET6_USART/AUDIO_RECORD/record_board_audio.c
static void board_audio_dma_drain(void)
{
    uint32_t timeout = AUDIO_DMA_BUFFER_HALFWORDS * 4U;

    while (board_audio_dma_used_halfwords() > AUDIO_DMA_PREROLL_HALFWORDS && timeout-- > 0U)
    {
        __NOP();
    }
}

static uint32_t board_audio_i2s_freq(uint32_t sample_rate)
{
    if (sample_rate >= 43000U && sample_rate <= 45000U)
        return I2S_AudioFreq_44k;
    return I2S_AudioFreq_48k;
}

static void board_audio_i2s_init_tx_rate(uint32_t sample_rate)
{
    I2S_InitTypeDef i2s;

    board_audio_dma_stop();
    SPI_I2S_DeInit(SPI3);
    i2s.I2S_Mode = I2S_Mode_MasterTx;
    i2s.I2S_Standard = I2S_Standard_Phillips;
    i2s.I2S_DataFormat = I2S_DataFormat_16b;
    i2s.I2S_MCLKOutput = I2S_MCLKOutput_Enable;
    i2s.I2S_AudioFreq = board_audio_i2s_freq(sample_rate);
    i2s.I2S_CPOL = I2S_CPOL_Low;
    I2S_Init(SPI3, &i2s);
    I2S_Cmd(SPI3, ENABLE);
    board_audio_dma_start();
    g_audio_debug.last_sample_rate = sample_rate;
    g_audio_debug.spi3_sr = SPI3->SR;
    g_audio_debug.spi3_i2scfgr = SPI3->I2SCFGR;
}

static void board_audio_i2s_init_tx(void)
{
    board_audio_i2s_init_tx_rate(AUDIO_SAMPLE_RATE);
}

static uint32_t board_audio_i2s_record_freq(uint32_t sample_rate)
{
    if (sample_rate <= 9500U)
        return I2S_AudioFreq_8k;
    if (sample_rate <= 13500U)
        return I2S_AudioFreq_11k;
    if (sample_rate <= 19000U)
        return I2S_AudioFreq_16k;
    if (sample_rate <= 27000U)
        return I2S_AudioFreq_22k;
    if (sample_rate <= 38000U)
        return I2S_AudioFreq_32k;
    if (sample_rate >= 43000U && sample_rate <= 45000U)
        return I2S_AudioFreq_44k;
    return I2S_AudioFreq_48k;
}

static void board_audio_i2s_init_rx_rate(uint32_t sample_rate)
{
    I2S_InitTypeDef i2s;

    board_audio_dma_stop();
    SPI_I2S_DeInit(SPI3);
    i2s.I2S_Mode = I2S_Mode_MasterRx;
    i2s.I2S_Standard = I2S_Standard_Phillips;
    i2s.I2S_DataFormat = I2S_DataFormat_16b;
    i2s.I2S_MCLKOutput = I2S_MCLKOutput_Enable;
    i2s.I2S_AudioFreq = board_audio_i2s_record_freq(sample_rate);
    i2s.I2S_CPOL = I2S_CPOL_Low;
    I2S_Init(SPI3, &i2s);
    I2S_Cmd(SPI3, ENABLE);
    g_audio_debug.last_sample_rate = sample_rate;
    g_audio_debug.spi3_sr = SPI3->SR;
    g_audio_debug.spi3_i2scfgr = SPI3->I2SCFGR;
}

static int board_audio_codec_init_playback(void)
{
    int result = 0;

    if (es8311_probe() != 0)
        return -1;

    result |= es8311_write_reg(0x00, 0x3F);
    audio_delay_ms(10);
    result |= es8311_write_reg(0x00, 0x80);
    audio_delay_ms(2);
    result |= es8311_write_reg(0x01, 0x30);
    result |= es8311_write_reg(0x02, 0x00);
    result |= es8311_write_reg(0x03, 0x10);
    result |= es8311_write_reg(0x16, 0x24);
    result |= es8311_write_reg(0x04, 0x10);
    result |= es8311_write_reg(0x05, 0x00);
    result |= es8311_write_reg(0x0B, 0x00);
    result |= es8311_write_reg(0x0C, 0x00);
    result |= es8311_write_reg(0x10, 0x1F);
    result |= es8311_write_reg(0x11, 0x7F);
    result |= es8311_write_reg(0x06, 0x0F);
    result |= es8311_write_reg(0x07, 0xFF);
    result |= es8311_write_reg(0x08, 0x04);
    result |= es8311_write_reg(0x09, 0x0C);
    result |= es8311_write_reg(0x0A, 0x4C);
    result |= es8311_write_reg(0x44, 0x08);
    result |= es8311_write_reg(0x31, 0x00);
    result |= es8311_write_reg(0x32, 0xBF);
    result |= es8311_write_reg(0x33, 0x00);
    result |= es8311_write_reg(0x34, 0x00);
    result |= es8311_write_reg(0x0D, 0x01);
    audio_delay_ms(120);
    result |= es8311_write_reg(0x0E, 0x02);
    result |= es8311_write_reg(0x12, 0x01);
    result |= es8311_write_reg(0x13, 0x10);
    result |= es8311_write_reg(0x14, 0x1A);
    result |= es8311_write_reg(0x0D, 0x06);
    audio_delay_ms(30);
    result |= es8311_write_reg(0x25, 0x00);
    result |= es8311_write_reg(0x01, 0x3F);
    board_audio_capture_debug_regs();
    return result;
}

static int board_audio_codec_init_record(void)
{
    int result = 0;

    if (es8311_probe() != 0)
        return -1;

    result |= es8311_write_reg(0x01, 0x30);
    result |= es8311_write_reg(0x02, 0x00);
    result |= es8311_write_reg(0x03, 0x10);
    result |= es8311_write_reg(0x04, 0x10);
    result |= es8311_write_reg(0x05, 0x00);
    result |= es8311_write_reg(0x06, 0x00);
    result |= es8311_write_reg(0x07, 0x10);
    result |= es8311_write_reg(0x08, 0x20);
    result |= es8311_write_reg(0x09, 0x30);
    result |= es8311_write_reg(0x0A, 0x00);
    result |= es8311_write_reg(0x0B, 0x00);
    result |= es8311_write_reg(0x0C, 0x00);
    result |= es8311_write_reg(0x14, 0x18);
    result |= es8311_write_reg(0x15, 0x00);
    result |= es8311_write_reg(0x16, 0x24);
    result |= es8311_write_reg(0x17, 0x88);
    result |= es8311_write_reg(0x18, 0x02);
    result |= es8311_write_reg(0x19, 0x20);
    result |= es8311_write_reg(0x1A, 0x20);
    result |= es8311_write_reg(0x37, 0x08);
    result |= es8311_write_reg(0x44, 0x00);
    result |= es8311_write_reg(0x00, 0x80);
    result |= es8311_write_reg(0x01, 0x3F);
    board_audio_capture_debug_regs();
    return result;
}

static void board_audio_write_word(int16_t value)
{
    while (SPI_I2S_GetFlagStatus(SPI3, SPI_I2S_FLAG_TXE) == RESET)
    {
    }
    SPI_I2S_SendData(SPI3, (uint16_t)value);
}

static int16_t board_audio_read_word(void)
{
    while (SPI_I2S_GetFlagStatus(SPI3, SPI_I2S_FLAG_RXNE) == RESET)
    {
    }
    return (int16_t)SPI_I2S_ReceiveData(SPI3);
}

static void board_audio_write_frame(int16_t left, int16_t right)
{
    board_audio_write_word(left);
    board_audio_write_word(right);
    g_audio_debug.tx_frames++;
}

int board_audio_init_playback(void)
{
    board_audio_gpio_init();
    board_audio_reset_debug(AUDIO_MODE_PLAYBACK);
    audio_delay_ms(10);
    board_audio_i2s_init_tx();
    audio_delay_ms(10);
    if (board_audio_codec_init_playback() != 0)
    {
        board_audio_set_error(-1);
        return -1;
    }
    audio_delay_ms(20);
    AUDIO_AMP_ENABLE();
    return 0;
}

int board_audio_init_record_rate(uint32_t sample_rate)
{
    if (sample_rate == 0U)
        sample_rate = AUDIO_SAMPLE_RATE;

