zyf021027/STM32F103ZE/STD_STM32F103ZET6_USART/AUDIO_RECORD/record_board_audio.c
    board_audio_gpio_init();
    board_audio_reset_debug(AUDIO_MODE_RECORD);
    g_audio_debug.last_sample_rate = sample_rate;
    AUDIO_AMP_DISABLE();
    audio_delay_ms(10);
    board_audio_i2s_init_rx_rate(sample_rate);
    audio_delay_ms(10);
    if (board_audio_codec_init_record() != 0)
    {
        board_audio_set_error(-2);
        return -1;
    }
    audio_delay_ms(20);
    AUDIO_AMP_DISABLE();
    board_audio_capture_debug_regs();
    return 0;
}

int board_audio_init_record(void)
{
    return board_audio_init_record_rate(AUDIO_SAMPLE_RATE);
}

int board_audio_init(void)
{
    return board_audio_init_playback();
}

void board_audio_set_sample_rate(uint32_t sample_rate)
{
    if (sample_rate == 0U || sample_rate == g_audio_debug.last_sample_rate)
        return;

    board_audio_i2s_init_tx_rate(sample_rate);
}

void board_audio_amp_set(int enabled)
{
    if (enabled)
        AUDIO_AMP_ENABLE();
    else
        AUDIO_AMP_DISABLE();
    board_audio_capture_debug_regs();
}

void board_audio_amp_set_pin_high(int high)
{
    if (high)
        GPIO_SetBits(AUDIO_AMP_PORT, AUDIO_AMP_PIN);
    else
        GPIO_ResetBits(AUDIO_AMP_PORT, AUDIO_AMP_PIN);
    board_audio_capture_debug_regs();
}

int board_audio_play_pcm(const int16_t *pcm, uint32_t samples, uint32_t channels)
{
    uint32_t i;

    if (pcm == RT_NULL || samples == 0U)
    {
        board_audio_set_error(-3);
        return -1;
    }

    g_audio_debug.last_channels = channels;
    g_audio_debug.spi3_sr = SPI3->SR;
    g_audio_debug.spi3_i2scfgr = SPI3->I2SCFGR;
    g_audio_debug.gpio_amp_state = GPIO_ReadOutputDataBit(AUDIO_AMP_PORT, AUDIO_AMP_PIN);
    board_audio_update_dma_debug();

    if (channels == 1U)
    {
        for (i = 0; i < samples; ++i)
            board_audio_dma_write_frame(board_audio_apply_volume(pcm[i]), board_audio_apply_volume(pcm[i]));
        board_audio_update_dma_debug();
        return 0;
    }

    if (channels == 2U)
    {
        for (i = 0; i < samples; ++i)
        {
            int32_t mixed = ((int32_t)pcm[i * 2U] + (int32_t)pcm[i * 2U + 1U]) / 2;
            int16_t sample = board_audio_apply_volume((int16_t)mixed);
            board_audio_dma_write_frame(sample, sample);
        }
        board_audio_update_dma_debug();
        return 0;
    }

    board_audio_set_error(-4);
    return -2;
}

void board_audio_drain(void)
{
    board_audio_dma_drain();
}

int board_audio_capture_pcm(int16_t *pcm, uint32_t samples, uint32_t channels)
{
    uint32_t i;
    int16_t left;
    int16_t right;

    if (pcm == RT_NULL || samples == 0U)
    {
        board_audio_set_error(-5);
        return -1;
    }

    if (channels != 1U && channels != 2U)
    {
        board_audio_set_error(-6);
        return -2;
    }

    g_audio_debug.last_channels = channels;

    for (i = 0; i < samples; ++i)
    {
        left = board_audio_read_word();
        right = board_audio_read_word();
        if (channels == 1U)
            pcm[i] = left;
        else
        {
            pcm[i * 2U] = left;
            pcm[i * 2U + 1U] = right;
        }
        g_audio_debug.rx_frames++;
    }

    return 0;
}

int board_audio_play_test_tone(uint32_t duration_ms)
{
    uint32_t total_samples = (AUDIO_SAMPLE_RATE * duration_ms) / 1000U;
    uint32_t index;

    for (index = 0; index < total_samples; ++index)
        board_audio_dma_write_frame(board_audio_apply_volume(audio_test_wave[index % AUDIO_TEST_TABLE_SIZE]), board_audio_apply_volume(audio_test_wave[index % AUDIO_TEST_TABLE_SIZE]));
    return 0;
}

const board_audio_debug_info_t *board_audio_get_debug_info(void)
{
    return &g_audio_debug;
}
